import { type Paint } from "./PaintsTypes";

export const PAINTS_MOCK: Paint[] = [ 
  {
    id: 1,
    title: "Акриловая краска ст 42",
    description: "Технические характеристики Церезит СТ 42Состав: водная дисперсия сополимеров акрилатов с минеральными наполнителями и пигментами.\nПлотность состава: 1,48 кг/дм3.\npH: 7,5–9,5.\nСтепень перетира: не более 60 мкм.\nТемпература применения: от +5 до +30°С.\nУстойчивость к дождю: через 24 часа.\nПаропроницаемость: класс V2 ок. 0,15 м.\nВодопоглощение: Класс W3, W ок. 0,08 кг/(м2·ч0,5) по ГОСТ 33352.\nСтойкость к грибку и плесени: да.\nТемпература эксплуатации: от –50 до +70°С.\nРасход: Около 0,3 л/м2 при двукратном нанесении. ",
    hiding_power: 222,
    photo: "1.png",
    is_delete: false
  },
  {
    id: 2,
    title:"Акриловая краска ст 44",
    description:"Технические характеристики\nостав CT 44:водная дисперсия сополимеров акрилатов с минеральными наполнителями и пигментами\nПлотность: ок. 1,35 кг/дм3\nрН: 7,5–9,5\nСтепень перетира: не более 60 мкм\nТемпература транспортировки и хранения: от +5 до +30°C\nТемпература применения: от +5 до +30°С\nТемпература эксплуатации: от –50 до +70°С\nУстойчивость к дождю: через 24 часа\nВодопоглощение по ГОСТ 33352: класс W3 W ок. 0,06 кг/(м2·ч0,5)\nПаропроницаемость по ГОСТ 33355: класс V2 Sd ок. 0,17 м\nГруппа горючести (ГОСТ 30244): Г1 (слабогорючие)\nГруппа воспламеняемости (ГОСТ 30402):В1 (трудновоспламеняемые)\nГруппа дымообразующей cпособности (ГОСТ 12.1.044): Д2 (с умеренной дымообразующей способностью)\nГруппа токсичности продуктов горения (ГОСТ 12.1.044): Т2 (умеренноопасные)\nСтойкость покрытия к влажному истиранию, мкм, класс: менее 5, 1 класс\nРасход краски CT 44: около 0,3 л/м2 при двукратном нанесении",
    hiding_power:202.5,
    photo:"2.png",
    is_delete:false
  },
  {
    id: 3,
    title:"Акриловая краска ст 48",
    description:"Технические характеристики\nостав CT 48:водная дисперсия сополимеров силиконов и акрилатов с минеральными наполнителями и пигментами \nПлотность: ок. 1,48 кг/дм3\nрН: 8,5–10,0\nСтепень перетира: не более 60 мкм\nТемпература транспортировки и хранения: от +5 до +30°C \nТемпература применения: от +5 до +30°С\nТемпература эксплуатации: от –50 до +70°С\nУстойчивость к дождю: через 24 часа Группа горючести (ГОСТ 30244): Г1 (слабогорючие)\nГруппа воспламеняемости (ГОСТ 30402): В1(трудновоспламеняемые)\nГруппа дымообразующейс пособности (ГОСТ 12.1.044):Д2 (с умеренной дымообразующей способностью) \nГруппа токсичности продуктов горения (ГОСТ 12.1.044): Т2 (умеренноопасные)\nСтойкость покрытия к влажному истиранию, мкм, класс: 5-10, 2 класс \nРасход краски CT 48: около 0,3 л/м2 при двукратном нанесении",
    hiding_power:222,
    photo:"3.png",
    is_delete:false
  }
];